** u/ilemming [[https://www.reddit.com/r/emacs/comments/t3_1fjnqgy/comment/t1_ls4kmt1][🔗]] 
*Votes* 9

You know that you can use vars in org source blocks that inject some data, like:

#+BEGIN_SRC elisp
 #+begin_src bash :var token="bla-bla-bla" 
 echo ${token}
 #+end_src

 #+RESULTS:
 : bla-bla-bla

#+END_SRC
That can be used to pass data from one block to another, right? So if you need to calculate something based on the result of another block, you just need a named block.

#+BEGIN_SRC elisp
 #+name: dirs
 #+begin_src bash :results silent
 ls 
 #+end_src

 #+begin_src js :var data=dirs 
 console.log(data)
 #+end_src

#+END_SRC
But did you know, you can also use elisp there?

#+BEGIN_SRC elisp
 #+begin_src js :var data=(if (featurep :system 'macos) "🍎" "🐧") 
 return data;
 #+end_src

 #+RESULTS:
 : 🍎

#+END_SRC
Or previous-like example with dirs but without needing additional source block:

#+BEGIN_SRC elisp
#+begin_src clojure :var data=(shell-command-to-string "ls -a ~") 
;; all dotfiles
(require '[clojure.string :as str])

(->>  (str/split data #"\n")
      (filter (partial re-find #"^\.*"))
      (sort)
      (str/join "\n"))
#+end_src
#+END_SRC

